target/classes/META-INF/wsdl/wwwh1.tjrj.jus.br/HMNI/Servico.svc.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Servico" targetNamespace="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:types><xsd:schema targetNamespace="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/Imports"><xsd:import schemaLocation="http://wwwh1.tjrj.jus.br/HMNI/Servico.svc?xsd=xsd0" namespace="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/"/><xsd:import schemaLocation="http://wwwh1.tjrj.jus.br/HMNI/Servico.svc?xsd=xsd1" namespace="http://www.cnj.jus.br/tipos-servico-intercomunicacao-2.2.2"/><xsd:import schemaLocation="http://wwwh1.tjrj.jus.br/HMNI/Servico.svc?xsd=xsd2" namespace="http://www.cnj.jus.br/intercomunicacao-2.2.2"/></xsd:schema></wsdl:types><wsdl:message name="consultarAvisosPendentesRequest"><wsdl:part name="consultarAvisosPendentes" element="tns:consultarAvisosPendentes"/></wsdl:message><wsdl:message name="consultarAvisosPendentesResponse"><wsdl:part name="consultarAvisosPendentesResposta" element="tns:consultarAvisosPendentesResposta"/></wsdl:message><wsdl:message name="consultarTeorComunicacaoRequest"><wsdl:part name="consultarTeorComunicacao" element="tns:consultarTeorComunicacao"/></wsdl:message><wsdl:message name="consultarTeorComunicacaoResponse"><wsdl:part name="consultarTeorComunicacaoResposta" element="tns:consultarTeorComunicacaoResposta"/></wsdl:message><wsdl:message name="consultarProcessoRequest"><wsdl:part name="consultarProcesso" element="tns:consultarProcesso"/></wsdl:message><wsdl:message name="consultarProcessoResponse"><wsdl:part name="consultarProcessoResposta" element="tns:consultarProcessoResposta"/></wsdl:message><wsdl:message name="entregarManifestacaoProcessualRequest"><wsdl:part name="entregarManifestacaoProcessual" element="tns:entregarManifestacaoProcessual"/></wsdl:message><wsdl:message name="entregarManifestacaoProcessualResponse"><wsdl:part name="entregarManifestacaoProcessualResposta" element="tns:entregarManifestacaoProcessualResposta"/></wsdl:message><wsdl:message name="consultarAlteracaoRequest"><wsdl:part name="consultarAlteracao" element="tns:consultarAlteracao"/></wsdl:message><wsdl:message name="consultarAlteracaoResponse"><wsdl:part name="consultarAlteracaoResposta" element="tns:consultarAlteracaoResposta"/></wsdl:message><wsdl:message name="confirmarRecebimentoRequest"><wsdl:part name="confirmarRecebimento" element="tns:confirmarRecebimento"/></wsdl:message><wsdl:message name="confirmarRecebimentoResponse"><wsdl:part name="confirmarRecebimentoResposta" element="tns:confirmarRecebimentoResposta"/></wsdl:message><wsdl:portType name="servico-intercomunicacao-2.2.2"><wsdl:operation name="consultarAvisosPendentes"><wsdl:input wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarAvisosPendentes" name="consultarAvisosPendentesRequest" message="tns:consultarAvisosPendentesRequest"/><wsdl:output wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/servico-intercomunicacao-2.2.2/consultarAvisosPendentesResponse" name="consultarAvisosPendentesResponse" message="tns:consultarAvisosPendentesResponse"/></wsdl:operation><wsdl:operation name="consultarTeorComunicacao"><wsdl:input wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarTeorComunicacao" name="consultarTeorComunicacaoRequest" message="tns:consultarTeorComunicacaoRequest"/><wsdl:output wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/servico-intercomunicacao-2.2.2/consultarTeorComunicacaoResponse" name="consultarTeorComunicacaoResponse" message="tns:consultarTeorComunicacaoResponse"/></wsdl:operation><wsdl:operation name="consultarProcesso"><wsdl:input wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarProcesso" name="consultarProcessoRequest" message="tns:consultarProcessoRequest"/><wsdl:output wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/servico-intercomunicacao-2.2.2/consultarProcessoResponse" name="consultarProcessoResponse" message="tns:consultarProcessoResponse"/></wsdl:operation><wsdl:operation name="entregarManifestacaoProcessual"><wsdl:input wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/entregarManifestacaoProcessual" name="entregarManifestacaoProcessualRequest" message="tns:entregarManifestacaoProcessualRequest"/><wsdl:output wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/servico-intercomunicacao-2.2.2/entregarManifestacaoProcessualResponse" name="entregarManifestacaoProcessualResponse" message="tns:entregarManifestacaoProcessualResponse"/></wsdl:operation><wsdl:operation name="consultarAlteracao"><wsdl:input wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarAlteracao" name="consultarAlteracaoRequest" message="tns:consultarAlteracaoRequest"/><wsdl:output wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/servico-intercomunicacao-2.2.2/consultarAlteracaoResponse" name="consultarAlteracaoResponse" message="tns:consultarAlteracaoResponse"/></wsdl:operation><wsdl:operation name="confirmarRecebimento"><wsdl:input wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/confirmarRecebimento" name="confirmarRecebimentoRequest" message="tns:confirmarRecebimentoRequest"/><wsdl:output wsaw:Action="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/servico-intercomunicacao-2.2.2/confirmarRecebimentoResponse" name="confirmarRecebimentoResponse" message="tns:confirmarRecebimentoResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="servico-intercomunicacao" type="tns:servico-intercomunicacao-2.2.2"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="consultarAvisosPendentes"><soap:operation soapAction="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarAvisosPendentes" style="document"/><wsdl:input name="consultarAvisosPendentesRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="consultarAvisosPendentesResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="consultarTeorComunicacao"><soap:operation soapAction="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarTeorComunicacao" style="document"/><wsdl:input name="consultarTeorComunicacaoRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="consultarTeorComunicacaoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="consultarProcesso"><soap:operation soapAction="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarProcesso" style="document"/><wsdl:input name="consultarProcessoRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="consultarProcessoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="entregarManifestacaoProcessual"><soap:operation soapAction="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/entregarManifestacaoProcessual" style="document"/><wsdl:input name="entregarManifestacaoProcessualRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="entregarManifestacaoProcessualResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="consultarAlteracao"><soap:operation soapAction="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/consultarAlteracao" style="document"/><wsdl:input name="consultarAlteracaoRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="consultarAlteracaoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="confirmarRecebimento"><soap:operation soapAction="http://www.cnj.jus.br/servico-intercomunicacao-2.2.2/confirmarRecebimento" style="document"/><wsdl:input name="confirmarRecebimentoRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="confirmarRecebimentoResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Servico"><wsdl:port name="servico-intercomunicacao" binding="tns:servico-intercomunicacao"><soap:address location="http://wwwh1.tjrj.jus.br/HMNI/Servico.svc"/></wsdl:port></wsdl:service></wsdl:definitions>